import { Typography } from "@/shared/ui/Typography";

export const SectionNineContent = () => {
  return (
    <div className="flex flex-col items-start justify-stretch">
      <Typography as="span">
        9.1. Настоящее Соглашение регулируется и&nbsp;толкуется
        в&nbsp;соответствии с&nbsp;законодательством Республики Казахстан.
        Вопросы, не&nbsp;урегулированные настоящим Соглашением, подлежат
        разрешению в&nbsp;соответствии с&nbsp;законодательством Республики
        Казахстан. Везде по&nbsp;тексту настоящего Соглашения, если&nbsp;явно
        не&nbsp;указано иное, под&nbsp;термином «законодательство» понимается
        как&nbsp;законодательство Республики Казахстан,
        так&nbsp;и&nbsp;законодательство места пребывания Пользователя.
      </Typography>

      <Typography as="span">
        9.2. Все&nbsp;объекты интеллектуальных прав, входящие в&nbsp;состав
        Приложения, в&nbsp;том&nbsp;числе элементы дизайна, графические
        изображения, иллюстрации, фотографии, видео, базы данных и&nbsp;другие
        объекты, являются интеллектуальной собственностью Компании,
        за&nbsp;исключением объектов интеллектуальных прав, принадлежавших
        Пользователю (фотографии, скан документа, удостоверяющего личность).
      </Typography>

      <Typography as="span">
        9.3. Компания сохраняет за&nbsp;собой право по&nbsp;своему усмотрению
        передавать информацию о&nbsp;Пользователе любым третьим лицам,
        предъявившим достаточные (по&nbsp;мнению Компании) доказательства
        нарушения Пользователем чьих-либо прав или&nbsp;требований действующего
        законодательства Республики Казахстан или&nbsp;решений государственных
        органов.
      </Typography>
    </div>
  );
};
