import { Typography } from "@/shared/ui/Typography";

export const SectionEightContent = () => {
  return (
    <div className="flex flex-col items-start justify-stretch">
      <Typography as="span">
        8.1. Настоящим Пользователи безотрывно, бессрочно и&nbsp;предоставляют
        письменное согласие (согласно требованиям казахстанского
        законодательства) и&nbsp;соглашаются на&nbsp;сбор и&nbsp;обработку
        персональных данных, как&nbsp;это&nbsp;описано в&nbsp;настоящем
        Договоре.
      </Typography>

      <Typography as="span">
        8.2. Сбор и&nbsp;обработка означает любую операцию с&nbsp;персональными
        данными независимо от&nbsp;используемых средств и&nbsp;процедуры,
        в&nbsp;частности сбор, запись, систематизацию, накопление, хранение,
        уточнение, обновление, изменение и&nbsp;извлечение персональных данных,
        а&nbsp;также их&nbsp;использование, передачу, распространение,
        предоставление, доступ, обезличивание, блокирование, удаление
        и&nbsp;уничтожение. Компания является контролёром данных, отвечает
        за&nbsp;цели обработки персональных данных Пользователей и&nbsp;может
        передавать персональные данные или&nbsp;поручать их&nbsp;обработку любой
        из&nbsp;связанных компаний партнёров в&nbsp;порядке, предусмотренном
        законодательством.
      </Typography>

      <Typography as="span">
        8.3. Главная цель Компании при&nbsp;сборе персональных данных&nbsp;—
        предоставление Пользователям безопасных и&nbsp;эффективных услуг,
        в&nbsp;том&nbsp;числе удобного клиентского сервиса.
      </Typography>

      <Typography>
        <Typography as="span">8.4. </Typography>
        Пользователи соглашаются с&nbsp;тем, что&nbsp;Компания также&nbsp;может
        использовать их&nbsp;персональные данные для:
      </Typography>

      <ul className="list-disc pl-5">
        <li>
          <Typography as="span">
            трансграничной передачи с&nbsp;учётом требований законодательства;
          </Typography>
        </li>
        <li>
          <Typography as="span">
            разрешения споров, сбора отзывов и&nbsp;выявления неисправностей;
          </Typography>
        </li>
        <li>
          <Typography as="span">
            анализа и&nbsp;совершенствования услуг, и&nbsp;информационного
            наполнения Компании;
          </Typography>
        </li>
        <li>
          <Typography as="span">
            предоставления третьим лицам, в&nbsp;том&nbsp;числе для&nbsp;целей
            информационного оповещения;
          </Typography>
        </li>
        <li>
          <Typography as="span">
            информирования Пользователей об&nbsp;услугах, обновлении услуг
            на&nbsp;основании информационных предпочтений Пользователей;
          </Typography>
        </li>
        <li>
          <Typography as="span">
            индивидуальных рассылок посредством электронной почты и&nbsp;(или)
            СМС&nbsp;(от&nbsp;чего Пользователи могут отказаться в&nbsp;любой
            момент, оповестив предварительно Компанию);
          </Typography>
        </li>
        <li>
          <Typography as="span">
            сравнения персональных данных для&nbsp;подтверждения
            их&nbsp;точности и&nbsp;проверки их&nbsp;третьими сторонами
            в&nbsp;случаях, предусмотренных законодательством.
          </Typography>
        </li>
      </ul>

      <Typography as="span">
        8.5. Компания обеспечивает конфиденциальность
        информации&nbsp;о&nbsp;стоимостях и&nbsp;условиях предоставления
        инфлюенсерами (блогерами) услуг&nbsp;в&nbsp;отношении предпринимателей.
      </Typography>

      <Typography as="span">
        8.6. При&nbsp;этом функционал приложения предполагает,
        что&nbsp;информацию, указанную в&nbsp;пункте 8.5&nbsp;Договора, могут
        видеть только Пользователи из&nbsp;категории предпринимателей.
      </Typography>

      <Typography as="span">
        8.7. Конфиденциальная информация подлежит охране бессрочно.
      </Typography>
    </div>
  );
};
