import { Typography } from "@/shared/ui/Typography";

export const SectionFiveContent = () => {
  return (
    <div className="flex flex-col items-start justify-stretch">
      <Typography as="span">
        5.1. В&nbsp;случаях неисполнения или&nbsp;ненадлежащего исполнения своих
        обязательств по&nbsp;Договору Стороны несут ответственность
        в&nbsp;соответствии с&nbsp;законодательством РК&nbsp;с&nbsp;учётом
        условий настоящего Договора.
      </Typography>

      <Typography as="span">
        5.2. Компания не&nbsp;несёт ответственность в&nbsp;случае ненадлежащего
        оказания услуг Пользователями в&nbsp;отношении иных пользователей.
      </Typography>

      <Typography as="span">
        5.3. Компания не&nbsp;несёт ответственность за&nbsp;несоответствие
        предоставленной услуги Пользователями ожиданиям иных пользователей.
      </Typography>

      <Typography as="span">
        5.4. Пользователь самостоятельно несёт ответственность за&nbsp;любые
        свои действия и/или бездействия, как&nbsp;умышленные,
        так&nbsp;и&nbsp;неумышленные, а&nbsp;равно за&nbsp;любые действия и/или
        бездействие лиц, использующих его&nbsp;учётные данные, связанные
        с&nbsp;размещением и/или распространением информации в&nbsp;сети
        интернет, получением посредством использования ресурсов Пользователя
        доступа к&nbsp;ресурсам третьих лиц, которые повлекли и/или могут
        повлечь нарушение законодательства, а&nbsp;также за&nbsp;любой ущерб,
        причинённый вышеуказанными действиями.
      </Typography>

      <Typography as="span">
        5.5. Пользователь самостоятельно несёт ответственность
        за&nbsp;соответствие содержания размещаемой Пользователем информации
        требованиям действующего законодательства, включая ответственность
        перед&nbsp;третьими лицами в&nbsp;случаях, когда размещение
        Пользователем той&nbsp;или&nbsp;иной информации, или&nbsp;содержание
        информации нарушает права и&nbsp;законные интересы третьих лиц,
        в&nbsp;том&nbsp;числе личные неимущественные права авторов, иные
        интеллектуальные права третьих лиц, и/или посягает на&nbsp;принадлежащие
        им&nbsp;нематериальные блага.
      </Typography>

      <Typography>
        <Typography as="span">5.6. </Typography>
        Компания не&nbsp;гарантирует, что:
      </Typography>

      <ul className="list-disc pl-5">
        <li>
          <Typography as="span">
            Приложение соответствует/будет соответствовать требованиям
            Пользователя;
          </Typography>
        </li>
        <li>
          <Typography as="span">
            услуги, связанные с&nbsp;Приложением/Заявками, будут предоставляться
            непрерывно, быстро, надёжно и&nbsp;без&nbsp;ошибок;
          </Typography>
        </li>
        <li>
          <Typography as="span">
            результаты, которые могут быть получены с&nbsp;использованием
            Приложения, будут точными и&nbsp;надёжными и&nbsp;могут
            использоваться для&nbsp;каких‑либо целей или&nbsp;в&nbsp;каком‑либо
            качестве (например, для&nbsp;установления и/или подтверждения
            каких‑либо фактов).
          </Typography>
        </li>
      </ul>
    </div>
  );
};
