import { Typography } from "@/shared/ui/Typography";

export const SectionOneContent = () => {
  return (
    <div className="flex flex-col items-start justify-stretch">
      <Typography as="span">
        1.1. В&nbsp;настоящей оферте, если&nbsp;контекст не&nbsp;требует иного,
        нижеприведённые термины имеют следующие значения:
      </Typography>

      <Typography>
        <Typography as="span">Оферта&nbsp;—</Typography>
        публичное предложение Компании, адресованное любому физическому лицу
        или&nbsp;юридическому лицу, а&nbsp;также&nbsp;индивидуальному
        предпринимателю, заключить с&nbsp;ним&nbsp;договор на&nbsp;условиях,
        изложенных в&nbsp;настоящей Оферте.
      </Typography>

      <Typography>
        <Typography as="span">Акцепт&nbsp;—</Typography>
        полное и&nbsp;безоговорочное принятие Пользователем условий настоящей
        Оферты о&nbsp;заключении договора.
      </Typography>

      <Typography>
        <Typography as="span">Пользователь&nbsp;—</Typography>
        любое физическое и/или юридическое лицо (предприниматель), желающий
        заключить гражданско-правовое соглашение с&nbsp;инфлюенсером (блогером),
        а&nbsp;также&nbsp;инфлюенсер (блогер), желающий заключить аналогичное
        соглашение&nbsp;с&nbsp;любым физическим и/или юридическим&nbsp;лицом,
        в&nbsp;том&nbsp;числе с&nbsp;индивидуальным предпринимателем.
      </Typography>

      <Typography>
        <Typography as="span">Заявка&nbsp;—</Typography>
        может содержать в&nbsp;себе коммерческое предложение инфлюенсерам
        (блогерам) на&nbsp;продвижение услуг, товаров и&nbsp;иных продуктов
        предпринимателей и/или коммерческое предложение инфлюенсеров (блогеров)
        на&nbsp;продвижение услуг, товаров и&nbsp;иных продуктов
        предпринимателей на&nbsp;условиях отдельного гражданско-правового
        соглашения, заключаемого между&nbsp;ними.
      </Typography>

      <Typography as="span">
        1.2. Текст, содержаний курсив с&nbsp;подчёркиванием в&nbsp;настоящем
        Договоре означает приведение примера в&nbsp;целях предоставления
        сторонам договора понимания того, каким образом применяется договорный
        пункт&nbsp;и&nbsp;(или) термин, в&nbsp;котором содержится часть текста
        с&nbsp;курсивом&nbsp;и&nbsp;подчёркиванием.
      </Typography>

      <Typography as="span">
        1.3. В&nbsp;Договоре могут использоваться иные термины,
        не&nbsp;определённые в&nbsp;настоящем разделе Договора, в&nbsp;этом
        случае толкование иных терминов, используемых в&nbsp;Договоре,
        осуществляется Сторонами, в&nbsp;первую очередь, согласно тому значению,
        которое дано соответствующим терминам&nbsp;в&nbsp;нормативно-правовых
        и/или нормативных актах Республики Казахстан и/или понимается
        в&nbsp;деловом обороте/практике.
      </Typography>
    </div>
  );
};
